node {
  name: "input_images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "split"
  op: "Split"
  input: "split/split_dim"
  input: "input_images"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 3
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 123.680000305
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "split"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 116.779998779
      }
    }
  }
}
node {
  name: "sub_1"
  op: "Sub"
  input: "split:1"
  input: "sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 103.940002441
      }
    }
  }
}
node {
  name: "sub_2"
  op: "Sub"
  input: "split:2"
  input: "sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "concat"
  op: "ConcatV2"
  input: "sub"
  input: "sub_1"
  input: "sub_2"
  input: "concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resnet_v1_50/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/Pad"
  op: "Pad"
  input: "concat"
  input: "resnet_v1_50/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resnet_v1_50/conv1/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 7
          }
          dim {
            size: 7
          }
          dim {
            size: 3
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/weights/read"
  op: "Identity"
  input: "resnet_v1_50/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/Pad"
  input: "resnet_v1_50/conv1/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 325.687316895
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 0.840725541115
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/conv1/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/conv1/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/conv1/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/conv1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/conv1/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/conv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/conv1/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/conv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/conv1/Conv2D"
  input: "resnet_v1_50/conv1/BatchNorm/gamma/read"
  input: "resnet_v1_50/conv1/BatchNorm/beta/read"
  input: "resnet_v1_50/conv1/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/conv1/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/conv1/Relu"
  op: "Relu"
  input: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/pool1/MaxPool"
  op: "MaxPool"
  input: "resnet_v1_50/conv1/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/pool1/MaxPool"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 273.713500977
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 7.90533161163
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/pool1/MaxPool"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 365.901000977
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 7.90533161163
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 606.016845703
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 8.70458316803
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 504.296569824
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 8.84055995941
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/add"
  op: "Add"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 256
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 1027.58581543
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 5.73583841324
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 1053.48803711
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 8.51875972748
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT8
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D"
  op: "Int8Conv2D"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights/read"
  attr {
    key: "FilterT"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "InT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "OutT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "filter_scale"
    value {
      f: 944.329040527
    }
  }
  attr {
    key: "input_scale"
    value {
      f: 12.1253604889
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "paddings"
    value {
      list {
        i: 0
        i: 0
        i: 0
        i: 0
      }
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean/read"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/add"
  op: "Add"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu"
  op: "Relu"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
